Revit 2027 API
Document.IsDetached Property
 Identifies if a workshared document is detached. Also, see IsWorkshared
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDetached { get; }
Public ReadOnly Property IsDetached As Boolean
	Get
public:
property bool IsDetached {
	bool get ();
}
member IsDetached : bool with get
Property Value
Boolean
Remarks
 Note that Title and PathName will be empty strings if a document is detached.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace